In [1]:
import pandas as pd
import numpy as np

from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error , mean_absolute_error, r2_score

In [2]:

# Sample data: Predict salary based on experience and age
data = {
    'years_experience': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'age': [22, 25, 28, 30, 32, 35, 38, 40, 43, 45],
    'salary': [30000, 35000, 42000, 48000, 55000, 62000, 70000, 78000, 85000, 95000]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   years_experience  age  salary
0                 1   22   30000
1                 2   25   35000
2                 3   28   42000
3                 4   30   48000
4                 5   32   55000
5                 6   35   62000
6                 7   38   70000
7                 8   40   78000
8                 9   43   85000
9                10   45   95000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   years_experience  10 non-null     int64
 1   age               10 non-null     int64
 2   salary            10 non-null     int64
dtypes: int64(3)
memory usage: 368.0 bytes

In [7]:
df.isnull().sum()

years_experience    0
age                 0
salary              0
dtype: int64

In [8]:
df.duplicated().sum()

np.int64(0)

In [10]:
# Step 1: Separate features (X) and target (y)
x = df.drop('salary', axis=1   )
y = df['salary']

In [11]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [12]:
scaler = StandardScaler()

x_train = scaler.fit_transform(x_train)
x_test = scaler.transform(x_test)

In [14]:
model = LinearRegression()
model.fit(x_train, y_train)

y_pred = model.predict(x_test)

print(f"MAE: {mean_absolute_error(y_test, y_pred):.2f}")
print(f"R2 score : {r2_score(y_test,y_pred):.2f}")
print(f"MSE: {mean_squared_error(y_test, y_pred):.2f}")
print(f"Coeffient: {model.coef_}")
print(f"intercept: {model.intercept_}")

MAE: 254.63
R2 score : 1.00
MSE: 88177.30
Coeffient: [26402.26634609 -6959.35898407]
intercept: 60000.0